
/Comment
The following intents are organized as follows:
Each 6 consective intents represent (1 base + 5 variants)
The five RAN intents followed by the two 5G-core intents
/endcomment

"Users in the specified RAN region should experience at least 30 Mbps average download speed." ,
"Ensure users in the designated RAN region receive an average download speed of no less than 30 Mbps",
"Users located in the specified RAN area must have an average download speed of 30 Mbps or above.",
"People in that RAN zone need to get around 30 Mbps download speed, minimum.",
"An average download speed of at least 30 Mbps should be experienced by users in the specified RAN region",
"Users in the specified RAN region should not experience average download speeds below 30 Mbps.",
"No more than 5% of the cells in this RAN area should have poor downlink signal strength",
"Ensure that poor downlink signal strength is present in no more than 5% of the cells within this RAN area.",
"Poor downlink signal strength must affect fewer than 5% of the cells in this RAN area.",
"No more than 5% of the cells in this RAN area should have weak downlink signal strength.",
"No more than 5% of the cells in this RAN area should be affected by poor downlink signal strength.",
"If more than 5% of the cells in this RAN area experience poor downlink signals, service quality may be compromised.",
"Ensure that fewer than 10% of the cells suffer from low SINR in this RAN region",
"Make sure that less than 10% of the cells in this RAN area are experiencing low SINR.",
"In this RAN region, low SINR should affect fewer than 10% of the cells.",
"Keep bad SINR below 10% of the cells in this RAN zone.",
"The operator should ensure that fewer than 10% of the cells suffer from low SINR in this RAN region.",
"Low SINR should not affect more than 10% of the cells in this RAN region.",
"In the rural macrocell area, the RAN infrastructure should operate at more than 80% energy efficiency",
"The RAN infrastructure in rural macrocells should function with energy efficiency above 80%.",
"The RAN system operating in the rural macrocell area must achieve energy efficiency higher than 80%.",
"The RAN system in rural macrocells should operate with more than 80% energy efficiency.",
"More than 80% energy efficiency should be achieved by the RAN infrastructure in the rural macrocell area.",
"If the RAN infrastructure in rural macrocells operates below 80% efficiency, energy waste may become significant.",
"Limit the number of simultaneously active users in the test RAN area to 200 or fewer",
"Restrict the number of concurrent users in the test RAN area to a maximum of 200.",
"Make sure the number of users connected simultaneously in the test RAN zone stays at or below 200.",
"Don’t let more than 200 people be online at once in the test RAN zone.",
"The number of simultaneously active users in the test RAN area must be limited to 200 or fewer.",
"If more than 200 users are active simultaneously in the test RAN area, system performance may degrade.",
"Ensure the number of PDU sessions in Urban Core is greater than 100000",
"Confirm that the Urban Core maintains more than 100000 PDU sessions.",
"The PDU session count in the Urban Core should be greater than 100000.",
"It is essential to maintain a PDU session volume exceeding 100000 in the Urban Core network segment.",
"Network administrators should ensure that the number of PDU sessions in the Urban Core is greater than 100000.",
"The number of PDU sessions in the Urban Core should not be less than 100000.",
"Ensure Throughput for External DN Traffic is at least 10 Gbps",
"Confirm that the throughput for External DN traffic reaches no less than 10 Gbps.",
"External DN traffic must achieve a throughput of no less than 10 Gbps.",
"Make sure the External DN line runs at 10 Gbps or more.",
"Throughput for External DN traffic must be ensured to be at least 10 Gbps.",
"If the throughput for External DN traffic drops under 10 Gbps, quality of service could be compromised."